[
  {
    "enuciado": "O que é um processo?",
    "alterA": "É um programa em execução",
    "alterB": "É um software em execução em terceiro plano",
    "alterC": "É um programa em tarefa",
    "alterD": "Tarefa em execução",
    "alternativaCorreta": "a"
  },
  {
    "enuciado": "Quantos estágios existem em um processo?",
    "alterA": "Um",
    "alterB": "Dois",
    "alterC": "Três",
    "alterD": "Quatro",
    "alternativaCorreta": "c"
  },
  {
    "enuciado": "Quais são os estágios de um processo",
    "alterA": "Execução, pronto e desbloqueado",
    "alterB": "Execução, pronto e bloqueado",
    "alterC": "Parado, pronto e desbloqueado",
    "alterD": "pronto, Parado e bloqueado",
    "alternativaCorreta": "b"
  },
  {
    "enuciado": "A maioria dos sistemas operacionais fornece certos conceitos básicos, como processos, espaços de endereçamento e arquivos, que são fundamentais para entendê-los. Nesse sentido, assinale a alternativa CORRETA.",
    "alterA": "A cada pessoa autorizada a usar um sistema é atribuída uma UID (User identification – identificação do usuário) pelo administrador do sistema. Todo processo iniciado tem a UID de quem o iniciou.",
    "alterB": "Um processo é basicamente um programa em execução. Associado a cada processo está seu espaço de endereçamento, uma lista de posições de memória, que vai de 0 até no máximo 1. O espaço de endereçamento contém um programa não executável, bem como os dados do programa.",
    "alterC": "Um processo pode preencher todo seu espaço de endereçamento, porém, é necessário que haja espaço suficiente na memória para armazená-lo completamente. Em muitos computadores os endereços são de 232 bits, dando um espaço de endereçamento de 64 bitso",
    "alterD": "O processo de endereçamento é acoplado à memória física da máquina, porém, não é maior que essa memória.",
    "alternativaCorreta": "a"
  },
  {
    "enuciado": "Arquivos são unidades lógicas de informação criadas por processos. Em geral, um disco contém milhares de arquivos, um independente do outro. Nesse sentido, analise as afirmativas abaixo. <br/>I. Os processos podem ler os arquivos existentes e criar novos, se necessário. A informação armazenada em arquivos deve ser persistente, isto é, não pode ser afetada pela criação e pelo término de um processo.<br/>II. Arquivo é um mecanismo de abstração. Ele oferece meios de armazenar informações no disco e de lê-las depois. III. As regras exatas para nomear um arquivo são padrões de sistema para sistema, incluindo o fato de que todos os sistemas operacionais não permitem cadeias de caracteres como nomes de arquivos válidos. Assinale a alternativa CORRETA.",
    "alterA": "Apenas as afirmativas I e II estão corretas.",
    "alterB": "Todas as afirmativas estão corretas.",
    "alterC": "Apenas as afirmativas I e III estão corretas",
    "alterD": "Apenas as afirmativas II e III estão corretas.",
    "alternativaCorreta": "b"
  },
  {
    "enuciado": "Quantos estágios existem em um processo?",
    "alterA": "Um",
    "alterB": "Dois",
    "alterC": "Três",
    "alterD": "Quatro",
    "alternativaCorreta": "c"
  }
]
